; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=58, remove_proportion=0.101, bases=23, instance_id=17, output=./training, seed=58

(define (problem warehouse-17)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 - base
    )
    (:init
        (to-remove box13)
        (to-remove box14)
        (to-remove box38)
        (to-remove box42)
        (to-remove box48)
        (clear box15)
        (on box15 box48)
        (on-base box48 base1)
        (clear box2)
        (on box2 box26)
        (on box26 box31)
        (on-base box31 base2)
        (clear box40)
        (on box40 box19)
        (on-base box19 base3)
        (clear box14)
        (on box14 box52)
        (on box52 box27)
        (on-base box27 base4)
        (clear box45)
        (on box45 box29)
        (on box29 box46)
        (on box46 box44)
        (on-base box44 base5)
        (clear box35)
        (on box35 box32)
        (on box32 box41)
        (on-base box41 base6)
        (clear box3)
        (on box3 box1)
        (on box1 box17)
        (on box17 box42)
        (on-base box42 base7)
        (clear box47)
        (on box47 box38)
        (on-base box38 base8)
        (clear box57)
        (on box57 box50)
        (on box50 box49)
        (on box49 box8)
        (on-base box8 base9)
        (clear box7)
        (on box7 box34)
        (on box34 box12)
        (on box12 box33)
        (on box33 box30)
        (on-base box30 base10)
        (clear-base base11)
        (clear box6)
        (on box6 box25)
        (on-base box25 base12)
        (clear box23)
        (on box23 box5)
        (on-base box5 base13)
        (clear box11)
        (on-base box11 base14)
        (clear box9)
        (on box9 box20)
        (on box20 box43)
        (on box43 box4)
        (on-base box4 base15)
        (clear box18)
        (on box18 box16)
        (on box16 box53)
        (on-base box53 base16)
        (clear box54)
        (on-base box54 base17)
        (clear box21)
        (on-base box21 base18)
        (clear box58)
        (on box58 box56)
        (on box56 box13)
        (on-base box13 base19)
        (clear box36)
        (on box36 box37)
        (on box37 box10)
        (on-base box10 base20)
        (clear-base base21)
        (clear box55)
        (on box55 box28)
        (on box28 box39)
        (on box39 box22)
        (on box22 box51)
        (on box51 box24)
        (on-base box24 base22)
        (clear-base base23)
    )
    (:goal (and 
        (removed box13)
        (removed box14)
        (removed box38)
        (removed box42)
        (removed box48)
    ))
)

; plan
1. (move box15 box48 box11)
   deleted: (clear box11) (on box15 box48)
   added: (on box15 box11) (clear box48)
   goals met: 0 of 5
2. (remove box14 box52)
   deleted: (on box14 box52) (clear box14)
   added: (removed box14) (clear box52)
   goals met: 1 of 5
3. (move box3 box1 box15)
   deleted: (clear box15) (on box3 box1)
   added: (on box3 box15) (clear box1)
   goals met: 1 of 5
4. (move box1 box17 box18)
   deleted: (clear box18) (on box1 box17)
   added: (on box1 box18) (clear box17)
   goals met: 1 of 5
5. (move box17 box42 box1)
   deleted: (clear box1) (on box17 box42)
   added: (on box17 box1) (clear box42)
   goals met: 1 of 5
6. (move box47 box38 box17)
   deleted: (clear box17) (on box47 box38)
   added: (on box47 box17) (clear box38)
   goals met: 1 of 5
7. (move box58 box56 box2)
   deleted: (clear box2) (on box58 box56)
   added: (on box58 box2) (clear box56)
   goals met: 1 of 5
8. (move box56 box13 box21)
   deleted: (clear box21) (on box56 box13)
   added: (on box56 box21) (clear box13)
   goals met: 1 of 5
9. (remove-from-base box13 base19)
   deleted: (on-base box13 base19) (clear box13)
   added: (removed box13) (clear-base base19)
   goals met: 2 of 5
10. (remove-from-base box38 base8)
   deleted: (on-base box38 base8) (clear box38)
   added: (removed box38) (clear-base base8)
   goals met: 3 of 5
11. (remove-from-base box42 base7)
   deleted: (on-base box42 base7) (clear box42)
   added: (removed box42) (clear-base base7)
   goals met: 4 of 5
12. (remove-from-base box48 base1)
   deleted: (on-base box48 base1) (clear box48)
   added: (removed box48) (clear-base base1)
   goals met: 5 of 5
